docs: add Mermaid diagrams to examples section (#67)
Co-authored-by: Benoit TRAVERS <benoit.travers.fr@gmail.com>
